# arr 이라는 아파트가 생겼다. 2개층, 3개호 이다.
# 층을 만들어야 한다
arr = [
    [0,1,2], # 층을 의미, 0호 1호 2호
    [10,11,12]  # 층을 의미 1층0호, 1층1호, 1층2호
]

# rayal 아파트가 4개층 4개호이다. (모양은 편한대로하면 된다.)
royal = [[],[],[],[],]
# 한번에 한층을 밀어넣기
royal[0] = ["0층0호","0층1호","0층2호","0층3호"]
royal[1] = ["1층0호","1층1호","1층2호","1층3호"]

royal[2] = [
    ["2층0호0번방","2층0호1번방","2층0호2번방"], # 각 호
    ["2층1호0번방","2층1호1번방","2층1호2번방"],
    ["2층2호0번방","2층2호1번방","2층2호2번방"],
]

royal[3] = [
    ["3층0호0번방","3층0호1번방","3층0호2번방"],
    ["3층1호0번방","3층1호1번방","3층1호2번방"],
    ["3층2호0번방","3층2호1번방","3층2호2번방"]
]

print(royal)